---
kind: type
id: T:Autodesk.Revit.DB.Analysis.gbXMLBuildingHVACSystem
source: html/33ed4d48-c47a-6f56-dd22-ddfc4ad87519.htm
---
# Autodesk.Revit.DB.Analysis.gbXMLBuildingHVACSystem

Enumerations for gbXML (Green Building XML) format, used for energy
 analysis, schema version 0.34.

## Syntax (C#)
```csharp
public enum gbXMLBuildingHVACSystem
```

## Remarks
This enumeration corresponds to the HVAC System attribute in gbXML and
 is used to specify the Building HVAC System.